IRP/src/Documents/CashTransferOrder/CashTransferOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CashTransferOrder</name>
  <registerRecords>AccumulationRegister.R3035T_CashPlanning</registerRecords>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <attributes>
    <name>CashAdvanceHolder</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceivePeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>Receiver</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveUUID</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </attributes>
  <attributes>
    <name>SendAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>SendCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>SendPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>Sender</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>SendUUID</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </attributes>
  <attributes>
    <name>SendFinancialMovementType</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveFinancialMovementType</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveBranch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>SendLocalTotalAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>SendLocalRate</name>
    <type>
      <types>DefinedType.typeCurrencyRate</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveLocalTotalAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiveLocalRate</name>
    <type>
      <types>DefinedType.typeCurrencyRate</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IsFixed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Enums/CashFlowDirections/CashFlowDirections.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CashFlowDirections</name>
 <enumValues>
  <name>Incoming</name>
 </enumValues>
 <enumValues>
  <name>Outgoing</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/CashTransferOrder/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure();
	QueryArray = GetQueryTextsSecondaryTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);

	Tables.R3035T_CashPlanning.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);

	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map();
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure();
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure();
	StrParams.Insert("Ref", Ref);
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array();
	QueryArray.Add(MoneySender());
	QueryArray.Add(MoneyReceiver());
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array();
	QueryArray.Add(R3035T_CashPlanning());
	Return QueryArray;
EndFunction

Function MoneySender()
	Return "SELECT
		   |	CashTransferOrder.Company AS Company,
		   |	CashTransferOrder.Ref.Branch AS Branch,
		   |	CashTransferOrder.Ref AS Ref,
		   |	CashTransferOrder.Sender AS Account,
		   |	CashTransferOrder.SendAmount AS Amount,
		   |	CashTransferOrder.SendCurrency AS Currency,
		   |	CashTransferOrder.SendUUID AS Key,
		   |	CashTransferOrder.Date AS Period,
		   |	CashTransferOrder.SendPeriod AS SendPeriod,
		   |	CashTransferOrder.SendFinancialMovementType AS FinancialMovementType,
		   |	CashTransferOrder.CashAdvanceHolder
		   |INTO MoneySender
		   |FROM
		   |	Document.CashTransferOrder AS CashTransferOrder
		   |WHERE
		   |	CashTransferOrder.Ref = &Ref";
EndFunction

Function MoneyReceiver()
	Return "SELECT
		   |	CashTransferOrder.Company AS Company,
		   |	CashTransferOrder.Ref.ReceiveBranch AS ReceiveBranch,
		   |	CashTransferOrder.Ref AS Ref,
		   |	CashTransferOrder.Receiver AS Account,
		   |	CashTransferOrder.ReceiveAmount AS Amount,
		   |	CashTransferOrder.ReceiveCurrency AS Currency,
		   |	CashTransferOrder.ReceiveUUID AS Key,
		   |	CashTransferOrder.Date AS Period,
		   |	CashTransferOrder.ReceivePeriod AS ReceivePeriod,
		   |	CashTransferOrder.ReceiveFinancialMovementType AS FinancialMovementType,
		   |	CashTransferOrder.CashAdvanceHolder
		   |INTO MoneyReceiver
		   |FROM
		   |	Document.CashTransferOrder AS CashTransferOrder
		   |WHERE
		   |	CashTransferOrder.Ref = &Ref";
EndFunction

Function R3035T_CashPlanning()
	Return "SELECT
		   |	MoneySender.Period,
		   |	MoneySender.SendPeriod AS PlanningPeriod,
		   |	MoneySender.Company,
		   |	MoneySender.Branch,
		   |	MoneySender.Account,
		   |	MoneySender.Amount,
		   |	MoneySender.Currency,
		   |	VALUE(Enum.CashFlowDirections.Outgoing) AS CashFlowDirection,
		   |	MoneySender.Ref AS BasisDocument,
		   |	MoneySender.FinancialMovementType,
		   |	MoneySender.Key
		   |INTO R3035T_CashPlanning 
		   |FROM
		   |	MoneySender AS MoneySender
		   |
		   |UNION ALL
		   |
		   |SELECT
		   |	MoneyReceiver.Period,
		   |	MoneyReceiver.ReceivePeriod,
		   |	MoneyReceiver.Company,
		   |	MoneyReceiver.ReceiveBranch,
		   |	MoneyReceiver.Account,
		   |	MoneyReceiver.Amount,
		   |	MoneyReceiver.Currency,
		   |	VALUE(Enum.CashFlowDirections.Incoming) AS CashFlowDirection,
		   |	MoneyReceiver.Ref AS BasisDocument,
		   |	MoneyReceiver.FinancialMovementType,
		   |	MoneyReceiver.Key
		   |FROM
		   |	MoneyReceiver AS MoneyReceiver";
EndFunction
